<?php

namespace App\Http\Controllers;

use Illuminate\Support\Facades\DB;
use App\User;
use App\Models\UserInfo;

class RunController extends Controller
{


    public function runUser()
    {
        $user = new User();
        
        $user->sex = rand(1,2);

        $user->username = $this ->getNickName();

        $user->password = md5('xiaoyuan123456');

        list($user_name,$mobile) = $this ->getName($user->sex);

        $user->phone = $mobile;
        
        $user->head_image = 'images/user/user_default.jpg';

        list($email,$birth,$year) = $this->getEmailsex($user->sex);

        $user->email = $email;
        
        $user->save();

        $uid = $user->id;
        if($year>1994){
            $insert['marry_status'] = 1;
        }else{
            $insert['marry_status'] = rand(3,6);
        }
        
        $insert['uid']=$uid;
        $insert['user_name']=$user_name;

        if($user->sex==1){
            $insert['height']=rand(165,190);
            $insert['income']=rand(3,6);
            $insert['shape']=rand(3,6);
            $insert['education']=rand(4,6);
            $insert['weight']=rand(50,100);

        }else{
            $insert['height']=rand(155,180);
            $insert['income']=rand(3,5);
            $insert['shape']=rand(1,3);
            $insert['education']=rand(4,6);
            $insert['weight']=rand(40,70);
        }

        $insert['birthday'] = $birth;
        $insert['constellation']=rand(1,12);
        $insert['want_child']=rand(0,4);
        $insert['marry_time']=rand(0,5);
        $insert['created_at']=date('Y-m-d H:i:s');
        $insert['updated_at']=date('Y-m-d H:i:s');
        
        UserInfo::insert($insert);
    }


    private function getPhone($value='')
    {
        # code...
    }

    private function getName($sex=1)
    {

        $xing = ['李','王','张','刘','陈','杨','黄','赵','周','吴','徐','孙','朱','马','胡','郭','林','何','高','梁','郑','罗','宋','谢','唐','韩','曹','许','邓','萧','冯','曾','程','蔡','彭','潘','袁','於','董','余','苏','叶','吕','魏','蒋','田','杜','丁','沈','姜','范','江','傅','钟','卢','汪','戴','崔','任','陆','廖','姚','方','金','邱','夏','谭','韦','贾','邹','石','熊','孟','秦','阎','薛','侯','雷','白','龙','段','郝','孔','邵','史','毛','常','万','顾','赖','武','康','贺','严','尹','钱','施','牛','洪','龚'];

        $man = ['澄邈','德泽','海超','海阳','海荣','海逸','海昌','瀚钰','瀚文','涵亮','涵煦','涵蓄','涵衍','浩皛','浩波','浩博','浩初','浩宕','浩歌','浩广','浩邈','浩气','浩思','浩言','鸿宝','鸿波','鸿博','鸿才','鸿畅','鸿畴','鸿达','鸿德','鸿飞','鸿风','鸿福','鸿光','鸿晖','鸿朗','鸿文','鸿轩','鸿煊','鸿骞','鸿远','鸿云','鸿哲','鸿祯','鸿志','鸿卓','嘉澍','光济','澎湃','彭泽','鹏池','鹏海','浦和','浦泽','瑞渊','越泽','博耘','德运','辰宇','辰皓','辰钊','辰铭','辰锟','辰阳','辰韦','辰良','辰沛','晨轩','晨涛','晨濡','晨潍','鸿振','吉星','铭晨','起运','运凡','运凯','运鹏','运浩','运诚','运良','运鸿','运锋','运盛','运升','运杰','运珧','运骏','运凯','运乾','维运','运晟','运莱','运华','耘豪','星爵','星腾','星睿','星泽','星鹏','星然','震轩','震博','康震','震博','振强','振博','振华','振锐','振凯','振海','振国','振平','昂然','昂雄','昂杰','昂熙','昌勋','昌盛','昌淼','昌茂','昌黎','昌燎','昌翰','晨朗','德明','德昌','德曜','范明','飞昂','高旻','晗日','昊然','昊天','昊苍','昊英','昊宇','昊嘉','昊明','昊伟','昊硕','昊磊','昊东','鸿晖','鸿朗','华晖','金鹏','晋鹏','敬曦','景明','景天','景浩','俊晖','君昊','昆琦','昆鹏','昆纬','昆宇','昆锐','昆卉','昆峰','昆颉','昆谊','昆皓','昆鹏','昆明','昆杰','昆雄','昆纶','鹏涛','鹏煊','曦晨','曦之','新曦','旭彬','旭尧','旭鹏','旭东','旭炎','炫明','宣朗','学智','轩昂','彦昌','曜坤','曜栋','曜文','曜曦','曜灿','曜瑞','智伟','智杰','智刚','智阳','昌勋','昌盛','昌茂','昌黎','昌燎','昌翰','晨朗','昂然','昂雄','昂杰','昂熙','范明','飞昂','高朗','高旻','德明','德昌','德曜','智伟','智杰','智刚','智阳','瀚彭','旭炎','宣朗','学智','昊然','昊天','昊苍','昊英','昊宇','昊嘉','昊明','昊伟','鸿朗','华晖','金鹏','晋鹏','敬曦','景明','景天','景浩','景行','景中','景逸','景彰','昆鹏','昆明','昆杰','昆雄','昆纶','鹏涛','鹏煊','景平','俊晖','君昊','昆琦','昆鹏','昆纬','昆宇','昆锐','昆卉','昆峰','昆颉','昆谊','轩昂','彦昌','曜坤','曜文','曜曦','曜灿','曜瑞','曦晨','曦之','新曦','鑫鹏','旭彬','旭尧','旭鹏','旭东','浩轩','浩瀚','浩慨','浩阔','鸿熙','鸿羲','鸿禧','鸿信','泽洋','泽雨','哲瀚','胤运','佑运','允晨','运恒','运发','云天','耘志','耘涛','振荣','振翱','中震','子辰','晗昱','瀚玥','瀚昂','瀚彭','景行','景中','景逸','景彰','绍晖','文景','曦哲','永昌','子昂','智宇','智晖','晗日','晗昱','瀚昂','昊硕','昊磊','昊东','鸿晖','绍晖','文昂','文景','曦哲','永昌','子昂','智宇','智晖','浩然','鸿运','辰龙','运珹','振宇','高朗','景平','鑫鹏','昌淼','炫明','昆皓','曜栋','文昂','洛','璟','煜','芮','睿','晨','熠','悟','莹','颖','语','烜','瑄','萱','轩','珸','羽','璇','允','芸','沺','苒','阳','煦','珊','灿','耀','烨'];



        $woman = ['恨桃','依秋','依波','香巧','紫萱','涵易','忆之','幻巧','水风','安寒','白亦','惜玉','碧春','怜雪','听南','念蕾','紫夏','凌旋','芷梦','凌寒','梦竹','千凡','采波','元冬','思菱','平卉','笑柳','雪卉','南蓉','谷梦','巧兰','绿蝶','飞荷','平安','芷荷','怀瑶','慕易','若芹','紫安','曼冬','寻巧','寄波','尔槐','以旋','初夏','依丝','怜南','傲菡','谷蕊','笑槐','飞兰','笑卉','迎荷','元冬','痴安','妙绿','觅雪','寒安','沛凝','白容','乐蓉','映安','依云','映冬','凡雁','梦秋','梦凡','秋巧','若云','元容','怀蕾','灵寒','天薇','翠安','乐琴','宛南','怀蕊','白风','访波','亦凝','易绿','夜南','曼凡','亦巧','青易。冰真','白萱','友安','海之','小蕊','又琴','天风','若松','盼菡','秋荷','香彤','语梦','惜蕊','迎彤','沛白','雁山','易蓉','雪晴','诗珊','春冬','又绿','冰绿','半梅','笑容','沛凝','映秋','盼烟','晓凡','涵雁','问凝','冬萱','晓山','雁蓉','梦蕊','山菡','南莲','飞双','凝丝','思萱','怀梦','雨梅','冷霜','向松','迎丝','迎梅','雅彤','香薇','以山','碧萱','寒云','向南','书雁','怀薇','思菱','忆文','翠巧','怀山','若山','向秋','凡白','绮烟','从蕾','天曼','又亦','从安','绮彤','之玉','凡梅','依琴','沛槐','又槐','元绿','安珊','夏之','易槐','宛亦','白翠','丹云','问寒','易文','傲易','青旋','思真','雨珍','幻丝','代梅','盼曼','妙之','半双','若翠','初兰','惜萍','初之','宛丝','寄南','小萍','静珊','千风','天蓉','雅青','寄文','涵菱','香波','青亦','元菱','翠彤','春海','惜珊','向薇','冬灵','惜芹','凌青','谷芹','雁桃','映雁','书兰','盼香','向山','寄风','访烟','绮晴','映之','醉波','幻莲','谷冬','傲柔','寄容','以珊','紫雪','芷容','书琴','寻桃','涵阳','怀寒','易云','代秋','惜梦','尔烟','谷槐','怀莲','夜山','芷卉','向彤','新巧','语海','灵珊','凝丹','小蕾','迎夏','慕卉','飞珍','冰夏','亦竹','飞莲','海白','元蝶','春蕾','怀绿','尔容','小玉','幼南','凡梦','碧菡','初晴','宛秋','傲旋','新之','凡儿','夏真','静枫','痴柏','恨蕊','乐双','念薇','靖雁','寄松','丹蝶','元瑶','冰蝶','念波','迎松','海瑶','乐萱','凌兰','曼岚','若枫','傲薇','凡灵','乐蕊','秋灵','谷槐','觅云','寻春','恨山','从寒','忆香','觅波','静曼','青寒','笑天','涵蕾','元柏','代萱','紫真','千青','雪珍','寄琴','绿蕊','醉柳','诗翠','念瑶','孤风','曼彤','怀曼','香巧','采蓝','芷天','尔曼','巧蕊','兮','希','熙','惜','夕','曦','昔','歆','辛','馨','沁','念','素','尘','昀','优','悠','尤','宥','幽','囿','莜','筱','楚','翳','染','然','冉','霓','馥','陌','沫','扬','黎','施','虞','米','密','漫','穗','卡','兹','顾','夏','微','希','玥','婉','清','莹','沐','初','雅','兮','诗','陌','叶','安','浅','草','瑶','杉','杏','璃','茉','青','夕','颜','苏','唯','薇','雨','笙','柠','檬','南','聂','月','盛','樱','桃','睛','黛','梦','涵','慕','晓'];
        $xingshi = $xing[array_rand($xing)];

        if($sex==1){
            $ming = $man[array_rand($man)];
        }else{
            $ming = $woman[array_rand($woman)];
        }
        
        $aname    = $xingshi.$ming;

        $amobile  = '13' . substr(uniqid('', true), 19) . substr(microtime(), 2, 5);
        
        return [$aname,$amobile];

    }

    private function getEmailsex($sex=1)
    {
        $boy = ['Jacob','Michael','Ethan','Joshua','Alexander','Anthony','William','Christopher','Jayden','Andrew','Joseph','David','Noad','Aiden','James','Ryan','Logan','John','Nathan','Elijah','Christian','Gabriel','Benjamin','Jonathan','Tyler','Samuel','Nicholas','Gavin','Dylan','Jackson','Brandon','Caleb','Jackson','Brandon','Caleb','Mason','Angel','Isaac','Evan','Jack','Kevin','Jose','Isaiah','Luke','Landon','Justin','Lucas','Zachary','Jordan','Robert','Aaron','Brayden','Thomas','Cameron','Hunter','Austin','Adrian','Connor','Owen','Aidan','Jason','Julian','Wyatt','Charles','Luis','Carter','Juan','Chase','Diego','Jeremiah','Brody','Zavier','Adam','Carlos','Liam','Hayden','Jesus','Ian','Tristan','Bryan','Sean','Cole','Alex','Eric','Brian','Jaden','Carson','Blake','Ayden','Cooper Dominic','Brady','Caden','Josiah','Kyle','Colton','Kaden','Eli' ];

        $girl = ['Ellen','Anne','Dana','Diana','Catherine','Helen','Jean','Laura','Margaret','Malcolm ','Joan','Niki','Betty','Linda','Whitney','Lily','Barbara','Elizabeth','Helen','Katharine','Lee','Ann','Diana','Fiona','Judy','Doris','Rudy','Amanda','Shirley','Joan','Tracy','Melody','Helen','Debbie','Lisa','Yvonne','Shelly','Mary','Dolly','Nancy','Jane','Barbara','Shirley','Emily','Sophia','Vivian','Lillian','Joy','Ross','Julie','Gloria','Carol','Taylor','Wendy','Grace','Vivian','Caroline','Samantha','Maria','Kate','Demi','Sunny','Wendy','Ava','Christina','Judy','Susan','Grace','Alice','Joyce','Sally','Margaret','Rebecca','Teresa','Rita','Jessica','Elizabeth','Kelly','May','Julie','Amanda','Fiona'];

        if($sex==1){
            $name = $boy[array_rand($boy)];
            $year = mt_rand(1980,2000);
            $mon = mt_rand(1,12);
            $day = mt_rand(1,28);
        }else{
            $name = $girl[array_rand($girl)];
            $year = mt_rand(1984,1998);
            $mon = mt_rand(1,12);
            $day = mt_rand(1,28);
        }

        $birth = $year.'-'.$mon.'-'.$day;
        $birthuse = $year.$mon.$day;

        $wei = ["@sina.com","@163.com","@qq.com","@hotmail.com","@126.com","@163.com","@gmail.com","@yahoo.com"];

        return array($name.$birthuse.'@'.$wei[array_rand($wei)],$birth,$year);
    }




    private function getNickName($value='')
    {
        $nicheng_tou=array('快乐的','冷静的','醉熏的','潇洒的','糊涂的','积极的','冷酷的','深情的','粗暴的','温柔的','可爱的','愉快的','义气的','认真的','威武的','帅气的','传统的','潇洒的','漂亮的','自然的','专一的','听话的','昏睡的','狂野的','等待的','搞怪的','幽默的','魁梧的','活泼的','开心的','高兴的','超帅的','留胡子的','坦率的','直率的','轻松的','痴情的','完美的','精明的','无聊的','有魅力的','丰富的','繁荣的','饱满的','炙热的','暴躁的','碧蓝的','俊逸的','英勇的','健忘的','故意的','无心的','土豪的','朴实的','兴奋的','幸福的','淡定的','不安的','阔达的','孤独的','独特的','疯狂的','时尚的','落后的','风趣的','忧伤的','大胆的','爱笑的','矮小的','健康的','合适的','玩命的','沉默的','斯文的','香蕉','苹果','鲤鱼','鳗鱼','任性的','细心的','粗心的','大意的','甜甜的','酷酷的','健壮的','英俊的','霸气的','阳光的','默默的','大力的','孝顺的','忧虑的','着急的','紧张的','善良的','凶狠的','害怕的','重要的','危机的','欢喜的','欣慰的','满意的','跳跃的','诚心的','称心的','如意的','怡然的','娇气的','无奈的','无语的','激动的','愤怒的','美好的','感动的','激情的','激昂的','震动的','虚拟的','超级的','寒冷的','精明的','明理的','犹豫的','忧郁的','寂寞的','奋斗的','勤奋的','现代的','过时的','稳重的','热情的','含蓄的','开放的','无辜的','多情的','纯真的','拉长的','热心的','从容的','体贴的','风中的','曾经的','追寻的','儒雅的','优雅的','开朗的','外向的','内向的','清爽的','文艺的','长情的','平常的','单身的','伶俐的','高大的','懦弱的','柔弱的','爱笑的','乐观的','耍酷的','酷炫的','神勇的','年轻的','唠叨的','瘦瘦的','无情的','包容的','顺心的','畅快的','舒适的','靓丽的','负责的','背后的','简单的','谦让的','彩色的','缥缈的','欢呼的','生动的','复杂的','慈祥的','仁爱的','魔幻的','虚幻的','淡然的','受伤的','雪白的','高高的','糟糕的','顺利的','闪闪的','羞涩的','缓慢的','迅速的','优秀的','聪明的','含糊的','俏皮的','淡淡的','坚强的','平淡的','欣喜的','能干的','灵巧的','友好的','机智的','机灵的','正直的','谨慎的','俭朴的','殷勤的','虚心的','辛勤的','自觉的','无私的','无限的','踏实的','老实的','现实的','可靠的','务实的','拼搏的','个性的','粗犷的','活力的','成就的','勤劳的','单纯的','落寞的','朴素的','悲凉的','忧心的','洁净的','清秀的','自由的','小巧的','单薄的','贪玩的','刻苦的','干净的','壮观的','和谐的','文静的','调皮的','害羞的','安详的','自信的','端庄的','坚定的','美满的','舒心的','温暖的','专注的','勤恳的','美丽的','腼腆的','优美的','甜美的','甜蜜的','整齐的','动人的','典雅的','尊敬的','舒服的','妩媚的','秀丽的','喜悦的','甜美的','彪壮的','强健的','大方的','俊秀的','聪慧的','迷人的','陶醉的','悦耳的','动听的','明亮的','结实的','魁梧的','标致的','清脆的','敏感的','光亮的','大气的','老迟到的','知性的','冷傲的','呆萌的','野性的','隐形的','笑点低的','微笑的','笨笨的','难过的','沉静的','火星上的','失眠的','安静的','纯情的','要减肥的','迷路的','烂漫的','哭泣的','贤惠的','苗条的','温婉的','发嗲的','会撒娇的','贪玩的','执着的','眯眯眼的','花痴的','想人陪的','眼睛大的','高贵的','傲娇的','心灵美的','爱撒娇的','细腻的','天真的','怕黑的','感性的','飘逸的','怕孤独的','忐忑的','高挑的','傻傻的','冷艳的','爱听歌的','还单身的','怕孤单的','懵懂的');

        $nicheng_wei=array('嚓茶','凉面','便当','毛豆','花生','可乐','灯泡','哈密瓜','野狼','背包','眼神','缘分','雪碧','人生','牛排','蚂蚁','飞鸟','灰狼','斑马','汉堡','悟空','巨人','绿茶','自行车','保温杯','大碗','墨镜','魔镜','煎饼','月饼','月亮','星星','芝麻','啤酒','玫瑰','大叔','小伙','哈密瓜','数据线','太阳','树叶','芹菜','黄蜂','蜜粉','蜜蜂','信封','西装','外套','裙子','大象','猫咪','母鸡','路灯','蓝天','白云','星月','彩虹','微笑','摩托','板栗','高山','大地','大树','电灯胆','砖头','楼房','水池','鸡翅','蜻蜓','红牛','咖啡','机器猫','枕头','大船','诺言','钢笔','刺猬','天空','飞机','大炮','冬天','洋葱','春天','夏天','秋天','冬日','航空','毛衣','豌豆','黑米','玉米','眼睛','老鼠','白羊','帅哥','美女','季节','鲜花','服饰','裙子','白开水','秀发','大山','火车','汽车','歌曲','舞蹈','老师','导师','方盒','大米','麦片','水杯','水壶','手套','鞋子','自行车','鼠标','手机','电脑','书本','奇迹','身影','香烟','夕阳','台灯','宝贝','未来','皮带','钥匙','心锁','故事','花瓣','滑板','画笔','画板','学姐','店员','电源','饼干','宝马','过客','大白','时光','石头','钻石','河马','犀牛','西牛','绿草','抽屉','柜子','往事','寒风','路人','橘子','耳机','鸵鸟','朋友','苗条','铅笔','钢笔','硬币','热狗','大侠','御姐','萝莉','毛巾','期待','盼望','白昼','黑夜','大门','黑裤','钢铁侠','哑铃','板凳','枫叶','荷花','乌龟','仙人掌','衬衫','大神','草丛','早晨','心情','茉莉','流沙','蜗牛','战斗机','冥王星','猎豹','棒球','篮球','乐曲','电话','网络','世界','中心','鱼','鸡','狗','老虎','鸭子','雨','羽毛','翅膀','外套','火','丝袜','书包','钢笔','冷风','八宝粥','烤鸡','大雁','音响','招牌','胡萝卜','冰棍','帽子','菠萝','蛋挞','香水','泥猴桃','吐司','溪流','黄豆','樱桃','小鸽子','小蝴蝶','爆米花','花卷','小鸭子','小海豚','日记本','小熊猫','小懒猪','小懒虫','荔枝','镜子','曲奇','金针菇','小松鼠','小虾米','酒窝','紫菜','金鱼','柚子','果汁','百褶裙','项链','帆布鞋','火龙果','奇异果','煎蛋','唇彩','小土豆','高跟鞋','戒指','雪糕','睫毛','铃铛','手链','香氛','红酒','月光','酸奶','银耳汤','咖啡豆','小蜜蜂','小蚂蚁','蜡烛','棉花糖','向日葵','水蜜桃','小蝴蝶','小刺猬','小丸子','指甲油','康乃馨','糖豆','薯片','口红','超短裙','乌冬面','冰淇淋','棒棒糖','长颈鹿','豆芽','发箍','发卡','发夹','发带','铃铛','小馒头','小笼包','小甜瓜','冬瓜','香菇','小兔子','含羞草','短靴','睫毛膏','小蘑菇','跳跳糖','小白菜','草莓','柠檬','月饼','百合','纸鹤','小天鹅','云朵','芒果','面包','海燕','小猫咪','龙猫','唇膏','鞋垫','羊','黑猫','白猫','万宝路','金毛','山水','音响');

            $tou_num=rand(0,331);

            $wei_num=rand(0,325);

            $nicheng=$nicheng_tou[$tou_num].$nicheng_wei[$wei_num];

            return $nicheng; 

    }

    
}
